'''
f(x) = x^2 + 2cosx − 2
برای نشان دادن اینکه x = 0 ریشه‌ی معادله با مرتبه تکرار چهار است، باید اثبات کنیم که:
f(0) = f′(0) = f′′(0) = f′′′(0) = 0 و (f^(4))(0) != 0
که در آن (f^(n))(x) نشان‌دهنده‌ی مشتق n ام تابع f(x) است. برای این کار، ابتدا مشتقات تابع را محاسبه می‌کنیم:
f′(x) = 2x − 2sinx
f′′(x) = 2 − 2cosx
f′′′(x) = 2sinx
f(4)(x) = 2cosx
حالا اگر x=0 را در این مشتقات جایگذاری کنیم، داریم:
f(0)=2(1) − 2 = 0
f′(0)=0 − 0 = 0
f′′(0)=2 − 2 = 0
f′′′(0) = 0
(f^(4))(0)=2 != 0
پس می‌بینیم که شرایط لازم برقرار است و x=0 ریشه‌ی معادله با مرتبه تکرار چهار است.
'''
import math


def f(x):
    return x**2 + 2*math.cos(x) - 2


def df(x):
    return 2*x - 2*math.sin(x)

x0 = 0.5

epsilon = 10**-6

# تعریف یک متغیر برای شمارش تعداد تکرار
n = 0


while True:
    # محاسبه x بعدی با فرمول روش نیوتن
    x1 = x0 - 4 * f(x0)/df(x0)

    # چاپ مقدار x و تعداد تکرار
    print("x = ", x1, "n = ", n)

    # بررسی شرط خروج از حلقه
    if abs(x1 - x0) < epsilon:
        break

    # به روز رسانی مقدار x و تعداد تکرار
    x0 = x1
    n += 1

print("an approximate root for f(x) = 0 :")
print(x1)